Revit 2027 API
ScheduleDefinition.AreaSchemeId Property
 In an area schedule, the ID of the area scheme to display.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AreaSchemeId { get; }
Public ReadOnly Property AreaSchemeId As ElementId
	Get
public:
property ElementId^ AreaSchemeId {
	ElementId^ get ();
}
member AreaSchemeId : ElementId with get
Property Value
ElementId
Remarks
Schedules of the Areas category show area elements belonging to a single area scheme.
Key schedules of the Areas category apply to all area schemes, so they don't have an area scheme ID.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace